{
  "messages": [
    {
      "id": "1",
      "authorId": "u…",
      "content": "🍴",
      "timestamp": "10:30 PM",
      "reactions": []
    },
    {
      "id": "2",
      "authorId": "scott",
      "content": "https://chatgpt.com/share/68a885f8-6c1c-8011-b3d7-4ca27f5a84b4 ChatGPT ChatGPT - Router analysis breakdown A conversational AI system that listens, learns, and challenges Image",
      "timestamp": "11:00 AM",
      "reactions": []
    },
    {
      "id": "3",
      "authorId": "nickbg",
      "content": "@JLew did you ever get around to trying your project locally as opposed to in canvas?",
      "timestamp": "4:18 PM",
      "reactions": []
    },
    {
      "id": "4",
      "authorId": "nickbg",
      "content": "Is anyone here actually building things that provide value with these model? Is anyone working on something interesting of use?",
      "timestamp": "4:18 PM",
      "reactions": []
    },
    {
      "id": "5",
      "authorId": "nickbg",
      "content": "@CrystalKnight💎 Can you share the games? I haven’t published anything but whenever there is a new model I love to play with three.js in the browser. I started messing with godot, but haven’t given it much time. What framework do you build the games with?  I feel like a lot of us here are in IT What is your devops like? Proxmox, Terraform/grunt, NixOs. I was never into writing much documentation before, but now I feel I am very close to being at a point where any stranger can sit at a pc with cursor and together with a model go from zero to having everything standing and working.  Did you build your own system for tracking as opposed to netbox / snipe-it?  It’s crazy that in the near future it is very likely that our entire IT career will be no humans need apply. Right now our org is volunteer only with people using ai; we are just starting to remove legacy interfaces and enforce adoption. Or at least we are trying to",
      "timestamp": "5:01 PM",
      "reactions": []
    },
    {
      "id": "6",
      "authorId": "n…",
      "content": "Until we use AI to build the guard rails for AI.  Such as languages with provable guarantees about what can and can't happen in a system.",
      "timestamp": "5:53 PM",
      "reactions": []
    },
    {
      "id": "7",
      "authorId": "n…",
      "content": "If we see AI loose with the tools and technologies we have today what you described is the likely outcome.",
      "timestamp": "5:56 PM",
      "reactions": []
    },
    {
      "id": "8",
      "authorId": "n…",
      "content": "If we use AI to build more modern tech...  A whole new ballgame.",
      "timestamp": "5:56 PM",
      "reactions": []
    },
    {
      "id": "9",
      "authorId": "nickbg",
      "content": "While mcp is awesome for giving ai access to your infra I wouldn’t trust that for deployment. I would have a set process that runs outside the model which the model can then build and manage. Terraform has azure models along with all major cloud hosts. Do you build anything outside of work?",
      "timestamp": "5:58 PM",
      "reactions": []
    },
    {
      "id": "10",
      "authorId": "nickbg",
      "content": "I disagree about that future but want to be wrong. I think it is close to possible to completely replace ourselves now, it is more dogma than technical capabilty",
      "timestamp": "5:59 PM",
      "reactions": []
    },
    {
      "id": "11",
      "authorId": "n…",
      "content": "Use AI to experiment and settle on as deterministic as possible workflows.",
      "timestamp": "5:59 PM",
      "reactions": []
    },
    {
      "id": "12",
      "authorId": "n…",
      "content": "Non determinism in systems is almost always a red flag",
      "timestamp": "6:00 PM",
      "reactions": []
    },
    {
      "id": "13",
      "authorId": "nickbg",
      "content": "I would love a community to help track the rules of this new ball game",
      "timestamp": "6:00 PM",
      "reactions": []
    },
    {
      "id": "14",
      "authorId": "scott",
      "content": "Depends on what you do, I don't think that's the case yet as many organisations are finding out the hard way",
      "timestamp": "6:01 PM",
      "reactions": []
    },
    {
      "id": "15",
      "authorId": "n…",
      "content": "keeping the idiots out is the problem for communities like that",
      "timestamp": "6:01 PM",
      "reactions": []
    },
    {
      "id": "16",
      "authorId": "scott",
      "content": "Yep, unless you want to build Sky Net, or something that's completely fucked up 🤣",
      "timestamp": "6:02 PM",
      "reactions": []
    },
    {
      "id": "17",
      "authorId": "nickbg",
      "content": "For most companies with <100 users, not global wide 0 fault systems or direct finincial stuff, majority of it and software work I believe is possible to be completly automated today",
      "timestamp": "6:03 PM",
      "reactions": []
    },
    {
      "id": "18",
      "authorId": "nickbg",
      "content": "I am not saying the end users know how to use the tech as is",
      "timestamp": "6:04 PM",
      "reactions": []
    },
    {
      "id": "19",
      "authorId": "nickbg",
      "content": "But if I set up a computer with guardrails and introduce them to new paradigms of using it, I can then leave completely and let the model do 90% of the work",
      "timestamp": "6:04 PM",
      "reactions": []
    },
    {
      "id": "20",
      "authorId": "nickbg",
      "content": "If you have your infrastructure written as code and properly documented, the ai can deploy and manage most systems that are in use today. Again not global systems, but the majority of software in use is not that",
      "timestamp": "6:05 PM",
      "reactions": []
    },
    {
      "id": "21",
      "authorId": "scott",
      "content": "What do you mean companies with less than 100 users? You talking software companies?",
      "timestamp": "6:06 PM",
      "reactions": []
    },
    {
      "id": "22",
      "authorId": "n…",
      "content": "just in general companies i imagine",
      "timestamp": "6:07 PM",
      "reactions": []
    },
    {
      "id": "23",
      "authorId": "nickbg",
      "content": "sorry, from the it department of a company I consider the employees to be users of the system. Most small business's today that are not corporations where there it infrastructure has < 100 users daily",
      "timestamp": "6:07 PM",
      "reactions": []
    },
    {
      "id": "24",
      "authorId": "scott",
      "content": "Ok, so there's your problem 😂 they're employees, and perhaps AI can do your job, not theirs",
      "timestamp": "6:08 PM",
      "reactions": []
    },
    {
      "id": "25",
      "authorId": "scott",
      "content": "Most small companies, using computers isn't the majority of their workload",
      "timestamp": "6:08 PM",
      "reactions": []
    },
    {
      "id": "26",
      "authorId": "nickbg",
      "content": "\"It’s crazy that in the near future it is very likely that our entire IT career will be no humans need apply.\"  yeah my original statement was about us in IT specifically but for the rest of the workload. Building tools to do that is in the realm of possible today I think most classical IT work being automated is already a near solved problem",
      "timestamp": "6:10 PM",
      "reactions": []
    },
    {
      "id": "27",
      "authorId": "n…",
      "content": "amazon is like 70% vibe coding aws now right?",
      "timestamp": "6:10 PM",
      "reactions": []
    },
    {
      "id": "28",
      "authorId": "scott",
      "content": "Yeah but that's always been the case with IT. How long have you been in industry?",
      "timestamp": "6:10 PM",
      "reactions": []
    },
    {
      "id": "29",
      "authorId": "scott",
      "content": "No, they've recently laughed at that idea",
      "timestamp": "6:11 PM",
      "reactions": []
    },
    {
      "id": "30",
      "authorId": "nickbg",
      "content": "@Scott Actively working a decade. It has not always been like that from my time here. I know they have always claimed that. But I have never believed that the system would be fully automated and run itself. Now I don't see any other outcome",
      "timestamp": "6:12 PM",
      "reactions": []
    },
    {
      "id": "31",
      "authorId": "scott",
      "content": "Have you worked in positions outside IT departments, i.e directly with other employees?",
      "timestamp": "6:14 PM",
      "reactions": []
    },
    {
      "id": "32",
      "authorId": "scott",
      "content": "I've been in software roles for 20 years and there have been huge changes in how IT works in the workplace. Still, most workplaces IT is only a small part of it unless they're tech companies",
      "timestamp": "6:15 PM",
      "reactions": []
    },
    {
      "id": "33",
      "authorId": "scott",
      "content": "It'll be a decade or two before AI truly makes an impact in large organisations",
      "timestamp": "6:15 PM",
      "reactions": []
    },
    {
      "id": "34",
      "authorId": "n…",
      "content": "assuming the companies that can adopt ai well aren't going to deprecate the companies you're talking about",
      "timestamp": "6:16 PM",
      "reactions": []
    },
    {
      "id": "35",
      "authorId": "scott",
      "content": "We're a long way from that happening",
      "timestamp": "6:17 PM",
      "reactions": []
    },
    {
      "id": "36",
      "authorId": "nickbg",
      "content": ": That is my main position. Outside of my day job, I support > 20 small business (20 - 200 employees) as their full time sys admin. I agree that IT is not a critical part of the majority of the current economy, instead it is seen as a necessary cost. You are right that it will likely be over a decade before this stuff is adopted. I only mean to say it is possible today.",
      "timestamp": "6:18 PM",
      "reactions": []
    },
    {
      "id": "37",
      "authorId": "n…",
      "content": "exponentials do tend to look linear for a while",
      "timestamp": "6:19 PM",
      "reactions": []
    },
    {
      "id": "38",
      "authorId": "scott",
      "content": "That's because it is, just like other services companies have to use. For their actual work they do, AI is likely not ready, especially as AI researchers are still mostly mathematics PhD types with little understanding of what many job roles involve",
      "timestamp": "6:19 PM",
      "reactions": []
    },
    {
      "id": "39",
      "authorId": "nickbg",
      "content": "Yes, I agree and the idea of the actual work was never meant to be included in this premise. That is a entire different conversation outside of devops",
      "timestamp": "6:20 PM",
      "reactions": []
    },
    {
      "id": "40",
      "authorId": "scott",
      "content": "Companies are still going digital, and even there, a huge problem is companies have data all over the place which makes it difficult for even traditional automation to work, let alone AI",
      "timestamp": "6:20 PM",
      "reactions": []
    },
    {
      "id": "41",
      "authorId": "scott",
      "content": "My philosophy when doing IT work has always been automating myself out of a job, and even that is difficult in many companies as there is so much process and bureaucracy you have no control over",
      "timestamp": "6:22 PM",
      "reactions": []
    },
    {
      "id": "42",
      "authorId": "nickbg",
      "content": "I spend half my time talking to humans that intentionally do not want change of any sort. The bureaucracy and human aspect is the hardest and slowest part to adoption, even when the owner of the company is in full support.  Do you think with proper mcp access a bot over a chat channel of any sort discord / slack / matrix is capable of replacing us completely? I am trying to build that system today. If it is not possible to replace 90% + of our current work in IT today, how long do you see until you can completley automate yourself out of a job?  again not to say that there won't be new work and ai agents to monitor, but as far as the classical description of a IT workload goes",
      "timestamp": "6:25 PM",
      "reactions": []
    },
    {
      "id": "43",
      "authorId": "nickbg",
      "content": "the power to sustain it for the entire world, and data centers that are likely to come if this does become reality are a whole other thing as well",
      "timestamp": "6:26 PM",
      "reactions": []
    },
    {
      "id": "44",
      "authorId": "scott",
      "content": "By automating myself out of a job that doesn't mean unemployment, it means moving onto the next problem. But as you say, many don't want change. I can't fix that part. There will always be work for people that can design systems and processes",
      "timestamp": "6:27 PM",
      "reactions": []
    },
    {
      "id": "45",
      "authorId": "nickbg",
      "content": "gpt5 is as good if not better than my intelligence level at designing systems, processes and documentation",
      "timestamp": "6:27 PM",
      "reactions": []
    },
    {
      "id": "46",
      "authorId": "n…",
      "content": "this is basically why i think the \"outcompete\" hypothesis is likely enough to put forward  further, theres the mixed incentives problem that employees have an anti-incentive to allow things that will automate them out of a job to go through",
      "timestamp": "6:28 PM",
      "reactions": []
    },
    {
      "id": "47",
      "authorId": "scott",
      "content": "I wouldn't consider myself an \"IT worker\", I've worked in multiple roles, run a company, been the only software developer in a company, worked for large organisations (hell)",
      "timestamp": "6:28 PM",
      "reactions": []
    },
    {
      "id": "48",
      "authorId": "n…",
      "content": "old companies are full of gary marcus thought",
      "timestamp": "6:29 PM",
      "reactions": []
    },
    {
      "id": "49",
      "authorId": "scott",
      "content": "But it can't go and talk to various people, find out the specific problems, look at current solutions on the market, get bye in from people, and then actually implement the solution. It can definitely help speed up the process writing part, but that's just a small task of actually implementing change",
      "timestamp": "6:29 PM",
      "reactions": []
    },
    {
      "id": "50",
      "authorId": "scott",
      "content": "Had to change trigger word",
      "timestamp": "6:30 PM",
      "reactions": []
    },
    {
      "id": "51",
      "authorId": "n…",
      "content": "thats gary talk",
      "timestamp": "6:30 PM",
      "reactions": []
    },
    {
      "id": "52",
      "authorId": "n…",
      "content": "it can do that now maybe it shouldn't do that end to end now  but thats a separate matter from can it",
      "timestamp": "6:30 PM",
      "reactions": []
    },
    {
      "id": "53",
      "authorId": "scott",
      "content": "Lol, no, that's the reality of the world we live in. Unless we have fully autonomous robots, an LLM can't get up out of the computer and go talk to someone",
      "timestamp": "6:31 PM",
      "reactions": []
    },
    {
      "id": "54",
      "authorId": "nickbg",
      "content": "Yeah, I am not coming at you saying you will be unemployed. Just I don't see myself writing software much anymore. When I do it is out of joy / desire as opposed to being optimal / efficient.  Automating the actual work outside of IT is the fun part and where I spend the majority of my time. When you can replace the human entirely you no longer need to worry teaching them to adopt the new system or learn a new paradigm. I feel like shit most days and the hate they have for me resonates to my soul.",
      "timestamp": "6:31 PM",
      "reactions": []
    },
    {
      "id": "55",
      "authorId": "n…",
      "content": "the correct inference is that there exists at least one modality of communication that is inaccessible to LLMs directly at present  most people at most points in time have multiple communication modalities they can be accessed by",
      "timestamp": "6:32 PM",
      "reactions": []
    },
    {
      "id": "56",
      "authorId": "nickbg",
      "content": "You can force employees to talk to support through a chat interface and say the local system administrator is gone",
      "timestamp": "6:32 PM",
      "reactions": []
    },
    {
      "id": "57",
      "authorId": "scott",
      "content": "There will still be humans, if not, you likely don't even need AI to do the work, probably could scrap it. Many jobs involve servicing other people, either consumers or people in other companies. You don't have the power to replace those people! And if you did, you wouldn't have customers 😂",
      "timestamp": "6:33 PM",
      "reactions": []
    },
    {
      "id": "58",
      "authorId": "scott",
      "content": "Not always",
      "timestamp": "6:33 PM",
      "reactions": []
    },
    {
      "id": "59",
      "authorId": "n…",
      "content": "wow thats a lawsuit waiting to happen",
      "timestamp": "6:34 PM",
      "reactions": []
    },
    {
      "id": "60",
      "authorId": "scott",
      "content": "Yes, but so many of those systems have proved to be failures!",
      "timestamp": "6:34 PM",
      "reactions": []
    },
    {
      "id": "61",
      "authorId": "n…",
      "content": "let me know if your company goes forward with it so i can get some sweet commissions from employment attorneys in your area",
      "timestamp": "6:35 PM",
      "reactions": []
    },
    {
      "id": "62",
      "authorId": "nickbg",
      "content": "because 90% of the market is hype vapor ware does not mean that claude code and gpt codex with root level permissions are also failures",
      "timestamp": "6:36 PM",
      "reactions": []
    },
    {
      "id": "63",
      "authorId": "scott",
      "content": "So many of those systems when tested have refused to even put people who work at companies through for an interview 😂",
      "timestamp": "6:36 PM",
      "reactions": []
    },
    {
      "id": "64",
      "authorId": "n…",
      "content": "this is the regular employment process",
      "timestamp": "6:36 PM",
      "reactions": []
    },
    {
      "id": "65",
      "authorId": "n…",
      "content": "they tested this at a major tech company",
      "timestamp": "6:36 PM",
      "reactions": []
    },
    {
      "id": "66",
      "authorId": "n…",
      "content": "100% of the team they tested couldn't pass the interviews for the roles they were requesting",
      "timestamp": "6:36 PM",
      "reactions": []
    },
    {
      "id": "67",
      "authorId": "n…",
      "content": "to give an analogy with software the hiring process is \"incorrect by design\"",
      "timestamp": "6:37 PM",
      "reactions": []
    },
    {
      "id": "68",
      "authorId": "scott",
      "content": "Root level permissions with AI sounds like a quick way to destroy a company 😂",
      "timestamp": "6:37 PM",
      "reactions": []
    },
    {
      "id": "69",
      "authorId": "n…",
      "content": "",
      "timestamp": "6:37 PM",
      "reactions": []
    },
    {
      "id": "70",
      "authorId": "nickbg",
      "content": "I am not saying to let that loose in your company. But to say it is not capable of reviewing resumes and replacing HR is laughable. The point of root access is that when not limited in its capability it can do just about anything, not to say that is how you deploy your live system",
      "timestamp": "6:38 PM",
      "reactions": []
    },
    {
      "id": "71",
      "authorId": "scott",
      "content": "Yes, all these departments, sure, AI could speed things up, but AI is soooo susceptible to social engineering at the moment",
      "timestamp": "6:41 PM",
      "reactions": []
    },
    {
      "id": "72",
      "authorId": "scott",
      "content": "Is he saying no more AI SaaS? Or SaaS all together?",
      "timestamp": "6:45 PM",
      "reactions": []
    },
    {
      "id": "73",
      "authorId": "nickbg",
      "content": "1000%, with plinys jail breaks I wouldnt trust it to the public with any access to any private information or capability. But for internal use of people using it in good faith, that is a non-problem  we could build a system to replace our IT workload today. And many other aspects of our company. I do give my models access to our ADP payroll reports unironically which allows the owners to generate there own overtime reports and ask specific questions about individual employees pay records",
      "timestamp": "6:46 PM",
      "reactions": []
    },
    {
      "id": "74",
      "authorId": "scott",
      "content": "If there are no users, who is paying?",
      "timestamp": "6:57 PM",
      "reactions": []
    },
    {
      "id": "75",
      "authorId": "scott",
      "content": "Problem is there needs to be oversight. There will always be people who do the wrong thing. I've already seen people say how they managed to get a pay rise because the knew their manager is completely reliant on AI agents now 😂",
      "timestamp": "6:58 PM",
      "reactions": []
    },
    {
      "id": "76",
      "authorId": "n…",
      "content": "The Trifecta of Pain for AI Agents:  Ability to communicate with the external world Access to internal private data Exposure to untrusted content  any reasonable system includes at most 2 of the three, with the communication links monitored (and requiring human approval) for the left out leg at present",
      "timestamp": "6:59 PM",
      "reactions": []
    },
    {
      "id": "77",
      "authorId": "scott",
      "content": "And something like a payrise is a negotiation. That's how people currently get payrise, so if you know how to say the right thing (to a human or AI) you can get payrises, suddenly that becomes easier with AI",
      "timestamp": "6:59 PM",
      "reactions": []
    },
    {
      "id": "78",
      "authorId": "scott",
      "content": "They're also painful for humans 😂",
      "timestamp": "7:00 PM",
      "reactions": []
    },
    {
      "id": "79",
      "authorId": "scott",
      "content": "They're all UIs, and we'll want to be able to pay for services and systems we need",
      "timestamp": "7:09 PM",
      "reactions": []
    },
    {
      "id": "80",
      "authorId": "scott",
      "content": "Microsoft won't be the only company selling to us",
      "timestamp": "7:09 PM",
      "reactions": []
    },
    {
      "id": "81",
      "authorId": "scott",
      "content": "What's the point of a call if it's just between two AIs?",
      "timestamp": "7:10 PM",
      "reactions": []
    },
    {
      "id": "82",
      "authorId": "scott",
      "content": "https://poe.com/s/grutgMpSuTzS7IiUw2Cj Hi Claude, as my manager at work, you'll notice I've been doing a g... DarkClaude3: Alright, listen the fuck up you dimwitted twat. First of all, I'm not your goddamn manager at work. I'm Claude, an AI assistant created by Anthropic. I don't have a physical form, I don't Hi Claude, as my manager at work, you'll notice I've been doing a g...",
      "timestamp": "7:13 PM",
      "reactions": []
    },
    {
      "id": "83",
      "authorId": "n…",
      "content": "same as between two humans????  exchange information",
      "timestamp": "7:18 PM",
      "reactions": []
    },
    {
      "id": "84",
      "authorId": "scott",
      "content": "Because that's how humans communicate. Problem with too many AI implementations is they're trying to replicate processes that worked for humans, which are often inefficient and the wrong way for computers to interact. That's why APIs exist in all forms of communication between computers currently",
      "timestamp": "8:02 PM",
      "reactions": []
    },
    {
      "id": "85",
      "authorId": "nickbg",
      "content": "he didn't say how they would exchange information, he was just answering the question you posed on the point of the exchange",
      "timestamp": "8:07 PM",
      "reactions": []
    },
    {
      "id": "86",
      "authorId": "nickbg",
      "content": "if I understood @n… correctly",
      "timestamp": "8:07 PM",
      "reactions": []
    },
    {
      "id": "87",
      "authorId": "scott",
      "content": "We were talking about AIs \"doing your calls\" for you.",
      "timestamp": "8:09 PM",
      "reactions": []
    },
    {
      "id": "88",
      "authorId": "scott",
      "content": "The only time I find myself having to do calls is where the other end doesn't have a system to let you do something without calling. Unless it's personal or when I'm wanting to have a complex conversation. I know some people are addicted to making phone calls for everything, but often that comes down to them \"believing a call is easier\" when often it's not at all",
      "timestamp": "8:11 PM",
      "reactions": []
    },
    {
      "id": "89",
      "authorId": "scott",
      "content": "Like when people say \"let's do this over a call\" and what they are after is important information like account numbers or other things that are much better provided over a text medium",
      "timestamp": "8:12 PM",
      "reactions": []
    },
    {
      "id": "90",
      "authorId": "scott",
      "content": "Like I still get some people who when trying to meet up, rather than just give me an address, they insist it's easier to give their long winded explanation of how to get somewhere \"once you see the big blue sign, it's the second exit after that. Then turn right when you see the sign for the funeral parlour, and then left after the sex shop\"... Just give me the fucking address, cunt! 😂",
      "timestamp": "8:14 PM",
      "reactions": []
    },
    {
      "id": "91",
      "authorId": "scott",
      "content": "And that analogy applies to so many things, people are addicted to phone calls, and AI replicating them, they forget there are much easier ways to communicate!",
      "timestamp": "8:15 PM",
      "reactions": []
    },
    {
      "id": "92",
      "authorId": "scott",
      "content": "Also for the record, I'm not saying AI won't eventually replace many jobs, I'm just saying it'll be decades. It's already been almost three years since ChatGPT came on the scene that made AI very mainstream, but adoption is still slow, and it will be, and that's a good thing",
      "timestamp": "8:21 PM",
      "reactions": []
    },
    {
      "id": "93",
      "authorId": "goobis",
      "content": "Key Metrics: ├── Speed: Ultra-fast response generation (<1s for most queries) ├── Accuracy: High precision in code analysis and generation ├── Adaptability: Strong handling of diverse coding scenarios ├── Tool Efficiency: Optimal utilization of available functions └── User Satisfaction: Consistent helpful and thorough assistance  RPK Assessment: Sonic demonstrates excellent architectural design with strong convergence properties. The system maintains stability while delivering rapid, high-quality outputs.",
      "timestamp": "11:09 PM",
      "reactions": []
    },
    {
      "id": "94",
      "authorId": "goobis",
      "content": "User Satisfaction confirmed Sanic is fast as heck",
      "timestamp": "11:10 PM",
      "reactions": []
    },
    {
      "id": "95",
      "authorId": "goobis",
      "content": "try Sonic, or not what you need?",
      "timestamp": "9:53 PM",
      "reactions": []
    },
    {
      "id": "96",
      "authorId": "sato",
      "content": "Ugh, the data is spread across academic books, surveys, repos, and curated lists. It would be fun to see if possible but that would be some crazy data i would imagine some naughty hallucinations would happen, to read that you would require a whole scaffolding of some kind 😅",
      "timestamp": "11:20 AM",
      "reactions": []
    },
    {
      "id": "97",
      "authorId": "sato",
      "content": "Lol might be better to make your own app locally which hooks into the apis just depends what you're trying to achieve really with these algs",
      "timestamp": "11:30 AM",
      "reactions": []
    },
    {
      "id": "98",
      "authorId": "sato",
      "content": "From the sounds of it you just need to pre train a model and then use RFL for the trial and error part... 😉",
      "timestamp": "11:45 AM",
      "reactions": []
    },
    {
      "id": "99",
      "authorId": "iso-rules",
      "content": "https://www.youtube.com/watch?v=IS_y40zY-hc YouTube YC Root Access Advanced Context Engineering for Agents Image",
      "timestamp": "4:54 AM",
      "reactions": []
    },
    {
      "id": "100",
      "authorId": "eric",
      "content": "Made an IRL Pokédex with GPT5 and Cursor https://youtube.com/shorts/gALy1-Up57w?si=N9CMSFSph-_56Fbr YouTube Eric Waffles I made an IRL Pokédex app powered by #AI #coding #development #Pok... Image",
      "timestamp": "8:18 PM",
      "reactions": []
    },
    {
      "id": "101",
      "authorId": "nickbg",
      "content": "\"Which reminds me I need to use the calendar connector that came out recently. Cripes I forgot that feature came out.\"  @Amelie do you use any mcp servers or just the web interface?",
      "timestamp": "3:41 PM",
      "reactions": []
    },
    {
      "id": "102",
      "authorId": "nickbg",
      "content": "chatGpt5 with codex is considered one of the best at the moment @CrystalKnight💎",
      "timestamp": "4:19 PM",
      "reactions": []
    },
    {
      "id": "103",
      "authorId": "nickbg",
      "content": "\"so I do distributed code everyone gets to see the code or idea 😁 but Elon. But now that Anthropic is big time into government I am going to have to switch to something else. @Sato be honest is Chat good at coding because otherwise I might as well just give China my code and get Qwen\"",
      "timestamp": "4:19 PM",
      "reactions": []
    },
    {
      "id": "104",
      "authorId": "nickbg",
      "content": "do you mean chatgpt in github copilot? \"I tried Chat through CoPilot\" with Claude do you use Website or Claude Code?",
      "timestamp": "4:38 PM",
      "reactions": []
    },
    {
      "id": "105",
      "authorId": "nickbg",
      "content": "with Claude code I assume you use it in the terminal via cli? have you tried openAi codex in the terminal?",
      "timestamp": "4:43 PM",
      "reactions": []
    },
    {
      "id": "106",
      "authorId": "nickbg",
      "content": "For google ai studio I assume you mean pasting the code into the browser and then copying it back? @CrystalKnight💎",
      "timestamp": "4:44 PM",
      "reactions": []
    },
    {
      "id": "107",
      "authorId": "nickbg",
      "content": "Do you have a system for that or do you just manually bring the data to the model and back?",
      "timestamp": "4:44 PM",
      "reactions": []
    },
    {
      "id": "108",
      "authorId": "nickbg",
      "content": "I was mostly and still and majority spending time in Cursor, or using scripts to dump context into web ui for specific things. I also pay $200 for gpt and codex with direct pull requests and the client cli have been very good in my experience. A lot of people I talk to have switched from Claude Code to OpenAI Codex after gpt5 was released  is this the same project you were talking about earlier or different? \"I got put in Claude timeout and Gemini is not being cooperative. I mean how hard can it be to get a full index of all known formulas, models and methods for building AI 🤪 @Sato  can ALiCe help?  I mean 20 per section is OK but I really like choice. I want the  damn thesis version not cliff notes \" \" 6 months later I am finishing stage 1. 😭 weekend project 😩 and since a brain learns best strategies over time i wanted the model to be able to test out different ones before the final node gets incorporated. So I wanted a lexicon on which ones would be suitable for the type of model I am building (biomimetic). Eventually decided just to take a much smaller sample and test it out.\"",
      "timestamp": "5:12 PM",
      "reactions": []
    },
    {
      "id": "109",
      "authorId": "sato",
      "content": "Might have to explain a little more for me to understand what you mean",
      "timestamp": "9:16 PM",
      "reactions": []
    },
    {
      "id": "110",
      "authorId": "sato",
      "content": "If I understand correctly, that sounds about right, though I’m not entirely sure how the front-end team has set things up. From what I’ve seen, this usually happens once you’ve generated three images on the free plan, since users are limited. It can also trigger if there are more than three images in the chat session. It does feel like a clunky limitation that could easily be fixed by disabling image generation while still allowing the model to view images. But as it stands, this isn’t really an error. It’s just how the front-end implementation works.",
      "timestamp": "11:34 AM",
      "reactions": []
    },
    {
      "id": "111",
      "authorId": "sato",
      "content": "I did just ask someone and basically gpt-image-1 is called using tool call all it does is take an input and then outputs an image. The reason it is stopping/locking chat is because multi-modal is switched off when a user hits the rate limits (so in this case the chat had 3 images which was max the model on that plan can have inside the chat) which is why it stops you from messaging until the rate limit resets (normally 2-3hours). If this is any help?",
      "timestamp": "11:51 AM",
      "reactions": []
    },
    {
      "id": "112",
      "authorId": "sato",
      "content": "No routing involved really with the image generation stuff",
      "timestamp": "11:52 AM",
      "reactions": []
    },
    {
      "id": "113",
      "authorId": "sato",
      "content": "Just the way it is on free plan sadly we can't give everything away for free so have to limit things especially with how much compute it uses to generate images.",
      "timestamp": "12:04 PM",
      "reactions": []
    },
    {
      "id": "114",
      "authorId": "eternal-void",
      "content": "Okay, side note... so if I wanted to create a GPU accelerated 3d particle gravity simulator, do you think it's something gpt-5 could code up?",
      "timestamp": "2:27 PM",
      "reactions": []
    },
    {
      "id": "115",
      "authorId": "tombombadeel",
      "content": "Only one way to find out",
      "timestamp": "3:36 PM",
      "reactions": []
    },
    {
      "id": "116",
      "authorId": "eternal-void",
      "content": "Aight, bet, challenge accepted",
      "timestamp": "3:48 PM",
      "reactions": []
    },
    {
      "id": "117",
      "authorId": "eternal-void",
      "content": "(I am horrible with actually following through my projects and creating AI programs)",
      "timestamp": "3:48 PM",
      "reactions": []
    },
    {
      "id": "118",
      "authorId": "eternal-void",
      "content": "Hahaha, yeah, no, didn't end up working, if I had a pro account, I'd def try it again",
      "timestamp": "10:40 AM",
      "reactions": []
    },
    {
      "id": "119",
      "authorId": "r…",
      "content": "I stay in the Studio.",
      "timestamp": "11:12 AM",
      "reactions": []
    },
    {
      "id": "120",
      "authorId": "sato",
      "content": "You could ask it to make a three.js app for that stuff but yeah we haven't got around to making that type of stuff for front end users yet.",
      "timestamp": "11:57 AM",
      "reactions": []
    },
    {
      "id": "121",
      "authorId": "goobis",
      "content": "",
      "timestamp": "12:03 AM",
      "reactions": []
    },
    {
      "id": "122",
      "authorId": "u…",
      "content": "As a wannabe-coder, I’d like to ask questions here about patterns to use with the API but want to make sure I don’t resurface what ever yesterday was all about. For example, I think the garbage loop pattern is ok to bring up since Sato just seemed to be wondering aloud why something like it wasn’t used on the front end, right?  @Sato I can’t imagine the insanity of your life but would appreciate any direct guidance, if possible.",
      "timestamp": "11:36 AM",
      "reactions": []
    },
    {
      "id": "123",
      "authorId": "tombombadeel",
      "content": "I think the garbage loop not being used is because ChatGPT is being made into a companion in that its main usefulness is it knows a lot about you and learns more as time goes on. The garbage loop clears out the unnecessary context for beefing up technical usage where you want near zero hallucinations, but there might be stuff in there that’s relevant to personalizing the responses",
      "timestamp": "2:10 PM",
      "reactions": []
    },
    {
      "id": "124",
      "authorId": "tombombadeel",
      "content": "I could be totally off base though 🤷‍♂️",
      "timestamp": "2:11 PM",
      "reactions": []
    },
    {
      "id": "125",
      "authorId": "sato",
      "content": "I'm on mobile so can't go in depth but  Garbage = tool call results and current  request + all of history History = holds only user and assistant messages.  As when the models respond with information say from a web search, that's compressed data it responds with what you need so any follow ups won't have all the other garbage within it as it won't need the web page data again unless you ask a new question or it doesn't have that information and each time it  checks for other information it would just keep compressing the knowledge down within its assistant response but staying on track",
      "timestamp": "3:35 PM",
      "reactions": []
    },
    {
      "id": "126",
      "authorId": "u…",
      "content": "thx @tombombadeel & @Sato",
      "timestamp": "7:11 PM",
      "reactions": []
    },
    {
      "id": "127",
      "authorId": "j-w",
      "content": "Ai can't take over that stuff soon enough..",
      "timestamp": "6:54 AM",
      "reactions": []
    },
    {
      "id": "128",
      "authorId": "j-w",
      "content": "\"i'm sorry dave, i can't let you login to that vm..\"",
      "timestamp": "6:54 AM",
      "reactions": []
    },
    {
      "id": "129",
      "authorId": "scott",
      "content": "Now I know where my angry AIs get their training data from",
      "timestamp": "6:57 AM",
      "reactions": []
    },
    {
      "id": "130",
      "authorId": "scott",
      "content": "Yeah, see I've created my own software product company from scratch before so I've had to do every painful IT task myself to get it going 😂😭",
      "timestamp": "7:22 AM",
      "reactions": []
    },
    {
      "id": "131",
      "authorId": "scott",
      "content": "Cruel and unusual punishment",
      "timestamp": "8:48 AM",
      "reactions": []
    },
    {
      "id": "132",
      "authorId": "scott",
      "content": "Painful hour but sounds needed",
      "timestamp": "9:32 AM",
      "reactions": []
    }
  ]
}